Repository: gsappcloud/cc-gsapp
Catalog: all/modules/pagination/translations/*.po
Languages: fr

source: <p>Each node type (<em>Page</em>, <em>Story</em>, etc...) may be set to paginate automatically (separated by an arbitrary number of words per page), or manually, by using either custom page breaks within your content, or @tag tags.</p> <ul> <li><strong>Default paging</strong>: Use Drupal's default pager to show pagination.</li> <li><strong>Table of contents</strong>: Use a Table of Contents to show pagination.</li> <li><strong>Default + ToC</strong>: Display both default pager and table of contents.</li> </ul> <p>In addition, the Table of Contents may be displayed as a <a href="!url">block</a>.</p>
fr: <p>Chaque type de noeud (<em>Page</em>, <em>Article</em>, etc...) peut être configuré pour être paginé automatiquement (selon un nombre quelconque de mots par page), ou manuellement, en utilisant soit un saut de page personnalisé à l'intérieur du contenu, soit les balises @tag.</p> <ul> <li><strong>Pagination par défaut</strong>: utilise la navigation par défaut de Drupal pour afficher la pagination.</li> <li><strong>Table des matières</strong>: utilise une table des matières pour afficher la pagination.</li> <li><strong>Par défaut + TdM</strong>: affiche la navigation par défaut ainsi que la table des matières.</li> </ul> <p>De plus, la table des matières peut être affichée comme un <a href="!url">bloc</a>.</p>

source: <p>Pagination (Node) allows the main content of arbitrary node types (<em>Page</em>, <em>Story</em>, etc...) to be paginated according to one of three methods:</p> <ul> <li><strong>Method 1</strong>: Content is paginated by a selectable "words per page" count.</li> <li><strong>Method 2</strong>: Content is paginated by manual breaks, inserted by the content creator.</li> <li><strong>Method 3</strong>: Content is paginated by manual breaks, based on @h3 tags.</li> </ul> <p>Method 1 allows for quick and easy pagination, and is ideal for users who are looking to have their longer content split into multiple pages with the least amount of hassle. Just select the "words per page" threshold for a particular content type, and all existing and future nodes of that type will be automatically paginated accordingly.</p> <p>Methods 2 and 3 allow for fine-tuned control over pagination breaks, useful for content creators who need to set specific break points in their content.</p> <p>note: To use Method 3 pagination, make sure @h3 tags are allowed under your <a href="!url">Input Filters</a>.</p> <h3>Pager Display</h3> <p>Pagination (Node) offers two styles of pager display. The default display uses Drupal's pagination, which shows as a collection of page numbers, including typical pager controls (such as <em>next page</em>, <em>previous page</em>, etc...). In addition to that, Pagination (Node) allows administrators to utilize a "Table of Contents" style list, which creates an index of pages, mapped to an optional page name. Content types may be adjusted to display the default pager, the table of contents pager, or both simultaneously.</p> <p>The "Table of Contents" may also be displayed as a block.</p> <h3>Page Headings</h3> <p>If a particular Content type is set to display a "Table of Contents" style list, page headings may be added for each page under any method. Methods 2 and 3 offer the more straight forward approaches, as content creators can add the page heading specifically in the page break: <em>ie. [ header = Sample Page Header ] or @h3Sample Page Header@h3end</em>. Regardless of paging method chosen, pages which do not have a specific title set will default to "<em>Page x</em>" within the table of contents. The only exception is the first page, which will always be the original title of the content.</p> <p>To set page titles under method 1, content creators may enter a collection of page titles while creating / updating their content. The interface will show the expected number of pages the content will have, and content creators may add a page titles (one per line) to match that number. The page estimate will be updated periodically while content is being added or updated.</p> <h3>Theming Notes</h3> <p>The default pager will respect alterations via the theme_pager hook. The table of contents may likewise be modified. Table of contents links are handled through theme_item_list. In addition, the ToC may be modified by the presence of a toc.tpl.php file in your theme. The ToC is a container (<em>id="pagination-toc"</em>), while the ToC menu may be styled based on their respective classes (<em>class="pagination-toc-list"</em> and <em>class="pagination-toc-item"</em>).</p>
fr: <p>Pagination (noeud) permet de paginer le corps d'un noeud de type quelconque (<em>Page</em>, <em>Article</em>, etc...) selon l'une des trois méthodes suivantes:</p> <ul> <li><strong>Méthode 1</strong>: le contenu est paginé selon un nombre de mots par page.</li> <li><strong>Méthode 2</strong>: le contenu est paginé grâce à des sauts de page manuels insérés par l'auteur du contenu.</li> <li><strong>Méthode 3</strong>: le contenu est paginé grâce à des sauts de page manuels basés sur les balises @h3.</li> </ul> <p>La méthode 1 permet de mettre en oeuvre la pagination rapidement et facilement, et est parfaite pour les utilisateurs qui veulent diviser leur long contenu en plusieurs pages, et ce avec le moins d'effort possible. Pour ce faire, sélectionner simplement une limite de mots par page pour un type de contenu particulier, et tous les noeuds déjà créés ou futurs de ce type seront automatiquement paginés selon cette valeur.</p> <p>Les méthodes 2 et 3 permettent un contrôle plus poussé relativement aux sauts de page, ce qui est utile aux auteurs qui ont besoin de placer des sauts spécifiques dans leur contenu.</p> <p>Note: pour utiliser la méthode 3, s'assurer que les balises @h3 sont permises dans les <a href="!url">filtres d'entrée</a>.</p> <h3>Affichage de la navigation</h3> <p>Pagination (noeud) offre deux modes d'affichage pour la navigation. L'affichage par défaut utilise la barre de pagination de Drupal, qui se présente comme une suite de numéros de page, incluant les autres liens habituels (comme <em>suivant</em>, <em>précédent</em>, etc...). De plus, Pagination (noeud) permet aux administrateurs de mettre en place une navigation par table des matières, qui crée un index de pages, avec optionnellement un nom pour chaque page. Les types de contenu peuvent être paramétrés pour afficher la navigation par défaut, ou la navigation par table des matières, ou les deux en même temps.</p> <p>La table des matières peut aussi être affichée comme un bloc.</p> <h3>Titres de page</h3> <p>Si un type de contenu particulier est paramétré pour afficher une navigation par table des matières, des titres peuvent être ajoutés pour chaque page, peu importe la méthode de pagination. Les méthodes 2 et 3 constituent l'approche la plus simple puisque les auteurs peuvent ajouter le titre de page directement dans le saut de page: <em>par exemple [ header = Titre de page ] ou @h3Titre de page@h3end</em>. Peu importe la méthode de pagination choisie, les pages n'ayant pas de titre spécifique s'afficheront dans la table des matières comme ceci: <em>Page x</em>. La seule exception concerne la première page, pour laquelle le titre original du contenu sera toujours utilisé.</p> <p>Pour paramétrer les titres de page avec la méthode 1, les auteurs peuvent saisir une suite de titres lors de la création ou de la modification de leur contenu. L'interface affiche une estimation du nombre de pages dans lesquelles le contenu sera réparti, et les auteurs peuvent ajouter les titres de page (un par ligne), en respectant le nombre de pages estimé. L'estimation du nombre de pages est mis à jour périodiquement au fil de l'ajout ou de la mise à jour du contenu.</p> <h3>Notes au sujet des thèmes</h3> <p>La navigation par défaut prend en compte les modifications apportées par le hook theme_pager. La table des matières peut être modifiée de la même façon. Les liens de la table des matières sont traités par theme_item_list. De plus, la TdM peut être modifiée grâce à la présence d'un fichier toc.tpl.php dans votre thème. La TdM est un conteneur (<em>id="pagination-toc"</em>), alors que le menu de la TdM peut être stylisé par ses classes respectives (<em>class="pagination-toc-list"</em> and <em>class="pagination-toc-item"</em>).</p>

source: No pagination
fr: Aucune pagination

source: Manual break - custom
fr: Saut manuel - personnalisé

source: Manul break - <h3>
fr: Saut manuel - <h3>

source: Default paging
fr: Pagination par défaut

source: Default paging + Table of Contents
fr: Pagination par défaut + Table des matières

source: Table of Contents
fr: Table des matières

source: Disable pagination for a specific node
fr: Désactiver la pagination pour un noeud spécifique

source: Place the node ids of nodes you wish to avoid pagination. Separate multiple node ids. ex: "1, 5, 7" will ignore nodes 1, 5, and 7
fr: Saisir l'id de chaque noeud pour lesquels vous voulez désactiver la pagination. Séparer les id si plus d'un est saisi. Par exemple, «1, 5, 7» va faire ignorer les noeuds 1, 5, et 7.

source: Provide a "Show full page" link
fr: Ajoute un lien «Afficher sur une seule page»

source: Enable a "Show full page" link below the content.
fr: Ajoute un lien «Afficher sur une seule page» en-dessous du contenu.

source: Set pagination
fr: Configurer la pagination

source: Pagination settings have been updated.
fr: La configuration de la pagination a été mise à jour.

source: Content type
fr: Type du contenu

source: Pagination style
fr: Mode de pagination

source: Table of Contents - Pagination
fr: Table des matières - Pagination

source: Pagination pager
fr: Navigation de la pagination

source: Pager
fr: Navigation

source: Pagination Table of Contents
fr: Pagination Table des matières

source: Show full page
fr: Afficher sur une seule page

source: Show paged
fr: Afficher sur plusieurs pages

source: Page headers
fr: Pagination et titres

source: If you would like your article to flow over more than one page, insert a page break within the body of your content at a convenient location:
fr: Si vous souhaitez faire afficher votre publication sur plus d'une page, insérez un saut de page dans le corps de votre publication à l'endroit désiré.

source: In addition, you may set a title for the specific page by using this syntax instead:
fr: De plus, vous pouvez préciser un titre pour la page en utilisant plutôt cette syntaxe:

source: <em>ex. <strong>[ header = My Section Title ]</strong></em>
fr: <em>ex.: <strong>[ header = Le titre de la section de ma publication ]</strong></em>

source: Your article pages will break according to the presence of @tag tags. The contents of your @tag will be used as the page title.
fr: Votre publication sera paginée selon la présence des balises @tags. Le contenu des @tags sera utilisé comme titre de page.

source: You may declare page headers here. The first line represents the title of the 2nd page. Note: the page estimate may be underestimated by one page (or so) in certain circumstances.
fr: Vous pouvez préciser les titres de page dans ce champ. La première ligne représente le titre de la deuxième page. Note: l'estimation du nombre de pages peut différer de la réalité d'environ une page dans certaines circonstances.

source: <div>Current page estimate: <span id="pagination-guess">1 page</span> (<span id="pagination-count">%words</span> words per page)</div>
fr: <div>Estimation du nombre de pages: <span id="pagination-guess">1 page</span> (<span id="pagination-count">%words</span> mots par page)</div>

source: Go to page !page
fr: Aller à la page !page

source: Table of Contents:
fr: Table des matières:

source: Pagination (Node)
fr: Pagination (noeud)

source: Allow for arbitrary nodes to be paginated.
fr: Permet de paginer des noeuds quelconques.

source: Extends the {node_type} table with a pagination value.
fr: Étend la table {node_type} par une valeur de pagination.

source: The {node_type} to enable pagination on.
fr: Le {node_type} pour lequel la pagination sera effective.

source: The approximate number of words per page while paginating.
fr: Le nombre approximatif de mots par page lors de la pagination.

source: The paging display style.
fr: Le mode d'affichage de la pagination.

source: Allows storage of page headers for a specific node under automatic paging.
fr: Permet l'enregistrement de titres de page pour un noeud quelconque selon un mode automatique de pagination.

source: The node id associated with the stored page headers.
fr: L'id d'un noeud associé aux titres de page mémorisés.

source: A serialized array of headers associated with a specific node id.
fr: Un tableau linéarisé de titres associés à l'id d'un noeud.

source: Allows arbitrary nodes to be paginated based automatic or manual paging
fr: Permet de paginer des noeuds quelconques selon un mode automatique ou manuel
